#+titlOAOAOAe: Go

** 显式
1. 显式转换
#+BEGIN_SRC go :results output
import "fmt"
func main(){
	a := int8(10)
	b := int16(20)
	c := int32(30)
	e := int64(a)+int64(b)+int64(c)
	fmt.Println("e:=",e)
}
#+END_SRC
#+RESULTS:
: e:= 60
 2. 基于显示的值比较的错误处理方案，函数/方法中错误都通过return语句显式返回，并且调用者不能忽略对错误的处理.
3. 组合
   - 正交的语法元素
     * 无类型层次体系，各类型之间是独立的，没有子类型的概念
     * 每个类型都可以有自己的方法集合，类型定义和方法实现是正交的
     * 实现某个接口，无需特定的修饰词
     * 包之间是独立的，没有子包的概念
一座座没有关联的孤岛，但是每个岛内又很精彩。将这些孤岛用最适当的方式建立关联，并形成一个整体。而go采用的组合方式，也是最主要的方式.
组合原则实质上是塑造了go程序的骨架结构。类型嵌入提供了垂直扩展能力，而接口是水平组合的关键，给与连接关节两个部分各自自由活动的能力。整体上又是是实现了某种功能，并且，组合也体现了简单的go原则。

4. 并发
   多核，原生支持并发作为设计原则之一。采用了用户级轻量线程。goroutine.
   channel和select并发原语.可以通过channel传递消息或者实现同步，通过select实现多路channel并发控制。
   并发与组合的哲学是一脉相承的。并发是更大一个组合的概念，它在程序设计的全局层面对程序进行拆解组合，再映射到程序执行层面：goroutines各自执行特定的工作，通过channel+select将groutines组合连接起来。并发的存在鼓励程序员在程序上设计进行独立计算的分解。
5. 面向工程
   1. 源码快速编译
   2. 源码导入不使用的包，无法编译。保证程序构建的时候不会编译额外的代码。
   3. 去掉包的循环依赖
   4. 包路径是唯一的，包名可以不必唯一
   5. 不支持默认函数参数
   6. 增加类型别名，支持大规模代码库重构

** 第一个go程序
#+BEGIN_SRC go :results output
import "fmt" //fmt是路径名
func main(){
	fmt.Println("hello,world\n") //fmt是包名
}
#+END_SRC

#+RESULTS:
: hello,world

go源文件是采用unicode字符集，用的是utf-8的字符编码方式.

